# Pandas
1. Series : 1차원 Vector + 명시적 index
2. DataFrame : 2차원 Matrix + 명시적 index

### Series

In [2]:
import numpy as np
import pandas as pd

In [3]:
L = [1,2,3,5]
pd.Series(L)   # index를 명시하지 않으면 0 부터 자동으로 index가 생성..

0    1
1    2
2    3
3    5
dtype: int64

In [4]:
L = [1,2,3,5]
pd.Series(L, index=['a','b','c','d'])   # index를 지정하면 지정된 인덱스로 생성..

a    1
b    2
c    3
d    5
dtype: int64

In [6]:
L = {'a':1, 'b':2, 'c':3, 'd':4}
pd.Series(L)       # dict의 경우 series로 만들면, key가 index가 된다..

a    1
b    2
c    3
d    4
dtype: int64

In [15]:
L = {'a':1, 'b':2, 'c':3, 'd':4}
S = pd.Series(L, index = ['a','b','c','d','e','f','g'])       # dict의 경우 series로 만들면, key가 index가 된다..

In [16]:
S['c']

3.0

In [17]:
S['g'] =100
S

a      1.0
b      2.0
c      3.0
d      4.0
e      NaN
f      NaN
g    100.0
dtype: float64

In [18]:
S.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [19]:
S.values

array([  1.,   2.,   3.,   4.,  nan,  nan, 100.])

### DataFrame

In [20]:
raw_data = {
    'first_name':['jason','molly','tina','jake','any'],
    'last_name':['miller','jacobson','ali','milner','cooze'],
    'age':[42,52,36,24,75],
    'city':['san francisco','baltimore','miami','douglas','boston']
}

raw_data

{'first_name': ['jason', 'molly', 'tina', 'jake', 'any'],
 'last_name': ['miller', 'jacobson', 'ali', 'milner', 'cooze'],
 'age': [42, 52, 36, 24, 75],
 'city': ['san francisco', 'baltimore', 'miami', 'douglas', 'boston']}

In [22]:
df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [23]:
pd.DataFrame(raw_data, columns = ['last_name','first_name'])

  last_name first_name
0    miller      jason
1  jacobson      molly
2       ali       tina
3    milner       jake
4     cooze        any

In [25]:
df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [ ]:
# 칼럼 선택

In [26]:
df['first_name']   # 칼럼명을로 칼럼선택

0    jason
1    molly
2     tina
3     jake
4      any
Name: first_name, dtype: object

In [27]:
df[['age','city']]

   age           city
0   42  san francisco
1   52      baltimore
2   36          miami
3   24        douglas
4   75         boston

In [28]:
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [34]:
df.index = ['a','b','c','d','e']
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [38]:
df.loc['e']

first_name       any
last_name      cooze
age               75
city          boston
Name: e, dtype: object

In [39]:
df.iloc[2]

first_name     tina
last_name       ali
age              36
city          miami
Name: c, dtype: object

In [43]:
# df['칼럼명'] => 해당 칼럼을 출력

# df.loc['인덱스명'] => 해당 row를 선택
# df.iloc[row번호] => 해당 row 선택

# df.loc['인덱스명', '칼럼명']
# df.iloc[인덱스번호, 칼럼번호]

In [44]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [48]:
df.loc[['b','c']]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami

In [49]:
df.iloc[[1,2]]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami

In [56]:
df.loc[['b','c','d'], ['last_name','age']]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [53]:
df.iloc[[1,2,3], [1,2]]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [88]:
df.iloc[1:3, [1,2]]

  last_name  age
b  jacobson   52
c       ali   36

In [57]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [89]:
df.iloc[1:4, 1:3]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [60]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [90]:
df.loc[:, 'first_name': 'age']

  first_name last_name  age
a      jason    miller   42
b      molly  jacobson   52
c       tina       ali   36
d       jake    milner   24
e        any     cooze   75

In [67]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [68]:
df.loc[['a','b'], ['last_name', 'age']]

  last_name  age
a    miller   42
b  jacobson   52

In [70]:
df.loc[['a','b'], ['first_name', 'age']]

  first_name  age
a      jason   42
b      molly   52

In [71]:
df.iloc[[0,1],[0,1]]

  first_name last_name
a      jason    miller
b      molly  jacobson

In [72]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [74]:
df.loc[['b','c'], ['last_name', 'age','city']]

  last_name  age       city
b  jacobson   52  baltimore
c       ali   36      miami

In [76]:
df.iloc[[1,2],[1,2,3]]

  last_name  age       city
b  jacobson   52  baltimore
c       ali   36      miami

In [83]:
df.iloc[[1,2],1:3]

  last_name  age
b  jacobson   52
c       ali   36

In [85]:
df.loc[['b','c'], 'first_name':'age']

  first_name last_name  age
b      molly  jacobson   52
c       tina       ali   36

In [87]:
df.loc[:, 'first_name':'age']

  first_name last_name  age
a      jason    miller   42
b      molly  jacobson   52
c       tina       ali   36
d       jake    milner   24
e        any     cooze   75

In [91]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [92]:
df['age']

a    42
b    52
c    36
d    24
e    75
Name: age, dtype: int64

In [95]:
df['age'] > 40

a     True
b     True
c    False
d    False
e     True
Name: age, dtype: bool

In [96]:
df.loc[df['age'] > 40]

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
e        any     cooze   75         boston

In [100]:
df['city'] == 'miami'

a    False
b    False
c     True
d    False
e    False
Name: city, dtype: bool

In [101]:
df.loc[df['city'] == 'miami']

  first_name last_name  age   city
c       tina       ali   36  miami

In [102]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [103]:
# 'ali'의 나이는?

In [104]:
df.last_name == 'ali'

a    False
b    False
c     True
d    False
e    False
Name: last_name, dtype: bool

In [106]:
df[df.last_name == 'ali'].age

c    36
Name: age, dtype: int64

In [107]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [108]:
df.T  # transpose : 행과 열의 전환..

                        a          b      c        d       e
first_name          jason      molly   tina     jake     any
last_name          miller   jacobson    ali   milner   cooze
age                    42         52     36       24      75
city        san francisco  baltimore  miami  douglas  boston

In [110]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [111]:
df.columns

Index(['first_name', 'last_name', 'age', 'city'], dtype='object')

In [113]:
df.to_csv('test_df.csv')

In [114]:
pwd

'D:\\BigData\\numpy_pandas'

In [117]:
df.head(3)

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami

In [119]:
df.tail(2)

  first_name last_name  age     city
d       jake    milner   24  douglas
e        any     cooze   75   boston

In [120]:
del df['age']

In [121]:
df

  first_name last_name           city
a      jason    miller  san francisco
b      molly  jacobson      baltimore
c       tina       ali          miami
d       jake    milner        douglas
e        any     cooze         boston

In [122]:
df.drop('a')

  first_name last_name       city
b      molly  jacobson  baltimore
c       tina       ali      miami
d       jake    milner    douglas
e        any     cooze     boston

In [123]:
df.drop('city', axis=1)

  first_name last_name
a      jason    miller
b      molly  jacobson
c       tina       ali
d       jake    milner
e        any     cooze

In [125]:
del df

In [126]:
df

NameError: name 'df' is not defined

In [129]:
df = pd.read_csv('test_df.csv')
df

  Unnamed: 0 first_name last_name  age           city
0          a      jason    miller   42  san francisco
1          b      molly  jacobson   52      baltimore
2          c       tina       ali   36          miami
3          d       jake    milner   24        douglas
4          e        any     cooze   75         boston

In [131]:
# apply

In [ ]:
# age칼럼의 값을 한국나이로 전환.. => +1

In [132]:
kage = []
for a in df.age:
    kage.append(a+1)
kage

[43, 53, 37, 25, 76]

In [133]:
def kage(a):
    return a+1

In [135]:
df['age'].apply(kage)

0    43
1    53
2    37
3    25
4    76
Name: age, dtype: int64

In [136]:
df['age'].apply(lambda x: x+1)

0    43
1    53
2    37
3    25
4    76
Name: age, dtype: int64

In [138]:
df['Job'] = ['teacher', 'driver','doctor','cook','engineer']
df

  Unnamed: 0 first_name last_name  age           city       Job
0          a      jason    miller   42  san francisco   teacher
1          b      molly  jacobson   52      baltimore    driver
2          c       tina       ali   36          miami    doctor
3          d       jake    milner   24        douglas      cook
4          e        any     cooze   75         boston  engineer

In [139]:
df['age'] = df['age'].apply(lambda x: x+1)
df

  Unnamed: 0 first_name last_name  age           city       Job
0          a      jason    miller   43  san francisco   teacher
1          b      molly  jacobson   53      baltimore    driver
2          c       tina       ali   37          miami    doctor
3          d       jake    milner   25        douglas      cook
4          e        any     cooze   76         boston  engineer